#数组的拼接
import numpy as np
#t1 = np.arange(0,12).reshape(2,6)
t1 = [[0,1,2,3,4,5],
      [6,7,8,9,10,11]]

#t2 = np.arange(12,24).reshape(2,6)
t2 = [[12,13,14,15,16,17],
      [18,19,20,21,22,23]]

#竖直拼接
t3 = np.vstack((t1,t2))
print(t3)

#水平拼接
t4 = np.hstack((t1,t2))
print(t4)

#数组的行交换
t5 = np.arange(12,24).reshape(3,4)
print(t5)
# t5 = [[12,13,14,15],
#       [16,17,18,19],
#       [20,21,22,23]]

# print('*'*50)
# print(t5[[2,1],:])
# print('$'*50)
print(t5)
t5[[1,2],:] = t5[[2,1],:]  #第2行和第3行交换位置
print(t5)

#数组的列交换
t5[:,[0,2]] = t5[:,[2,0]]  #第1列和第3列交换位置
print(t5)
