#假设你获取了250部电影时长（如列表a），希望统计出这些电影时长的分布状况
# （比如时长100分钟到120分钟电影的数量，出现的频率)等信息，
#你应该如何呈现这些数据
from matplotlib import pyplot as plt
from matplotlib import font_manager
my_font = font_manager.FontProperties(fname="C:\Windows\Fonts\msyh.ttc")
import numpy

a = [131, 93, 82, 81, 89, 116, 149, 94, 99, 128, 88, 124, 135, 121
    , 118, 135, 102, 95, 142, 117, 87, 132, 142, 108, 124, 141, 136
    , 101, 89, 89, 141, 129, 120, 106, 97, 139, 128, 120, 122, 97, 139
    , 130, 101, 116, 81, 94, 132, 84, 121, 84, 134, 125, 82, 137, 121
    , 135, 84, 100, 111, 114, 117, 100, 150, 104, 104, 111, 126, 87
    , 121, 95, 117, 129, 98, 92, 132, 123, 114, 140, 98, 107, 93, 149
    , 102, 123, 88, 106, 136, 111, 126, 84, 150, 91, 106, 105, 104, 126
    , 145, 93, 90, 94, 149, 84, 106, 139, 81, 140, 85, 88, 148, 81, 143
    , 88, 136, 102, 109, 115, 143, 112, 133, 139, 113, 100, 149, 121, 111
    , 121, 96, 88, 128, 149, 123, 82, 136, 127, 148, 133, 138, 143, 142, 97
    , 106, 86, 137, 113, 141, 104, 102, 90, 101, 84, 142, 141, 87, 117, 81
    ,144, 104, 112, 146, 115, 98, 103, 80, 124, 109, 118, 93, 85, 125, 148
    , 82, 146, 111, 150, 129, 81, 140, 132, 102, 116, 142, 83, 127, 95, 109
    , 144, 144, 149, 135, 84, 123, 148, 113, 80, 125, 104, 142, 121, 111, 110
    , 94, 112, 135, 134, 148, 87, 117, 125, 126, 84, 111, 87, 143, 112, 112, 102
    , 94, 82, 115, 136, 92, 146, 89, 107, 142, 139, 98, 135, 93, 140, 135, 80, 149
    , 111, 124, 84, 149, 149, 105, 138, 98, 134, 88, 146, 110, 90, 119, 88, 143, 136]

#用random.randint函数生成250个随机数，最后放到a中
# import random
# number = []
# for i in range(250):
#         b = random.randint(80, 150)
#         number.append(b)
# print(number)
# print(len(number))


#组距
d = 2
#计算组数
num_bins = (max(a)-min(a))//d
# print(num_bins)
# print(max(a))
# a.remove(max(a))
# a.append(min(a) + d * num_bins)
# num_bins = (max(a)-min(a))//d
# print(num_bins)
# print(min(a))
# print(max(a))

#设置图片大小
plt.figure(figsize=(20,8),dpi=80)

#绘制直方图
plt.hist(a,num_bins,density=1)

#设置x轴的刻度
plt.xticks(range(min(a),max(a)+d,d))

#绘制网格
plt.grid()

#展示图片
plt.show()


